HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMtu_regdef.h
/**
 * \file IfxMtu_regdef.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Mtu Mtu
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Mtu_Bitfields Bitfields
 * \ingroup IfxLld_Mtu
 * 
 * \defgroup IfxLld_Mtu_union Union
 * \ingroup IfxLld_Mtu
 * 
 * \defgroup IfxLld_Mtu_struct Struct
 * \ingroup IfxLld_Mtu
 * 
 */
#ifndef IFXMTU_REGDEF_H
#define IFXMTU_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Mtu_Bitfields
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_MTU_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID n (rw) */
} Ifx_MTU_ACCEN0_Bits;

/** \\brief  Access Enable Register 1 */
typedef struct _Ifx_MTU_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_MTU_ACCEN1_Bits;

/** \\brief  Identification Register */
typedef struct _Ifx_MTU_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_MTU_ID_Bits;

/** \\brief  Memory Autoinitialize Status Register 0 */
typedef struct _Ifx_MTU_MEMSTAT0_Bits
{
    unsigned int MEM0AIU:1;                 /**< \brief [0:0] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM1AIU:1;                 /**< \brief [1:1] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM2AIU:1;                 /**< \brief [2:2] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM3AIU:1;                 /**< \brief [3:3] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM4AIU:1;                 /**< \brief [4:4] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM5AIU:1;                 /**< \brief [5:5] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM6AIU:1;                 /**< \brief [6:6] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM7AIU:1;                 /**< \brief [7:7] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM8AIU:1;                 /**< \brief [8:8] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM9AIU:1;                 /**< \brief [9:9] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM10AIU:1;                /**< \brief [10:10] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM11AIU:1;                /**< \brief [11:11] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM12AIU:1;                /**< \brief [12:12] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM13AIU:1;                /**< \brief [13:13] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM14AIU:1;                /**< \brief [14:14] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM15AIU:1;                /**< \brief [15:15] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM16AIU:1;                /**< \brief [16:16] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM17AIU:1;                /**< \brief [17:17] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM18AIU:1;                /**< \brief [18:18] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM19AIU:1;                /**< \brief [19:19] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM20AIU:1;                /**< \brief [20:20] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM21AIU:1;                /**< \brief [21:21] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM22AIU:1;                /**< \brief [22:22] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM23AIU:1;                /**< \brief [23:23] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM24AIU:1;                /**< \brief [24:24] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM25AIU:1;                /**< \brief [25:25] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM26AIU:1;                /**< \brief [26:26] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM27AIU:1;                /**< \brief [27:27] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM28AIU:1;                /**< \brief [28:28] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM29AIU:1;                /**< \brief [29:29] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM30AIU:1;                /**< \brief [30:30] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int MEM31AIU:1;                /**< \brief [31:31] Memory x MBIST AutoInitialize Underway (rwh) */
} Ifx_MTU_MEMSTAT0_Bits;

