HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMtu_regdef.h
/** \\brief  Memory Autoinitialize Status Register 1 */
typedef struct _Ifx_MTU_MEMSTAT1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
    unsigned int MEM32AIU:0;                /**< \brief [31:32] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_32:1;             /**< \brief \internal Reserved */
    unsigned int MEM33AIU:0;                /**< \brief [32:33] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_33:1;             /**< \brief \internal Reserved */
    unsigned int MEM34AIU:0;                /**< \brief [33:34] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_34:1;             /**< \brief \internal Reserved */
    unsigned int MEM35AIU:0;                /**< \brief [34:35] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_35:1;             /**< \brief \internal Reserved */
    unsigned int MEM36AIU:0;                /**< \brief [35:36] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_36:1;             /**< \brief \internal Reserved */
    unsigned int MEM37AIU:0;                /**< \brief [36:37] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_37:1;             /**< \brief \internal Reserved */
    unsigned int MEM38AIU:0;                /**< \brief [37:38] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_38:1;             /**< \brief \internal Reserved */
    unsigned int MEM39AIU:0;                /**< \brief [38:39] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_39:1;             /**< \brief \internal Reserved */
    unsigned int MEM40AIU:0;                /**< \brief [39:40] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_40:1;             /**< \brief \internal Reserved */
    unsigned int MEM41AIU:0;                /**< \brief [40:41] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_41:1;             /**< \brief \internal Reserved */
    unsigned int MEM42AIU:0;                /**< \brief [41:42] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_42:1;             /**< \brief \internal Reserved */
    unsigned int MEM43AIU:0;                /**< \brief [42:43] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_43:1;             /**< \brief \internal Reserved */
    unsigned int MEM44AIU:0;                /**< \brief [43:44] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_44:1;             /**< \brief \internal Reserved */
    unsigned int MEM45AIU:0;                /**< \brief [44:45] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_45:1;             /**< \brief \internal Reserved */
    unsigned int MEM46AIU:0;                /**< \brief [45:46] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_46:1;             /**< \brief \internal Reserved */
    unsigned int MEM47AIU:0;                /**< \brief [46:47] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_47:1;             /**< \brief \internal Reserved */
    unsigned int MEM48AIU:0;                /**< \brief [47:48] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_48:1;             /**< \brief \internal Reserved */
    unsigned int MEM49AIU:0;                /**< \brief [48:49] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_49:1;             /**< \brief \internal Reserved */
    unsigned int MEM50AIU:0;                /**< \brief [49:50] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_50:1;             /**< \brief \internal Reserved */
    unsigned int MEM51AIU:0;                /**< \brief [50:51] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_51:1;             /**< \brief \internal Reserved */
    unsigned int MEM52AIU:0;                /**< \brief [51:52] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_52:1;             /**< \brief \internal Reserved */
    unsigned int MEM53AIU:0;                /**< \brief [52:53] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_53:1;             /**< \brief \internal Reserved */
    unsigned int MEM54AIU:0;                /**< \brief [53:54] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_54:1;             /**< \brief \internal Reserved */
    unsigned int MEM55AIU:0;                /**< \brief [54:55] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_55:1;             /**< \brief \internal Reserved */
    unsigned int MEM56AIU:0;                /**< \brief [55:56] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_56:1;             /**< \brief \internal Reserved */
    unsigned int MEM57AIU:0;                /**< \brief [56:57] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_57:1;             /**< \brief \internal Reserved */
    unsigned int MEM58AIU:0;                /**< \brief [57:58] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_58:1;             /**< \brief \internal Reserved */
    unsigned int MEM59AIU:0;                /**< \brief [58:59] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_59:1;             /**< \brief \internal Reserved */
    unsigned int MEM60AIU:0;                /**< \brief [59:60] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_60:1;             /**< \brief \internal Reserved */
    unsigned int MEM61AIU:0;                /**< \brief [60:61] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_61:1;             /**< \brief \internal Reserved */
    unsigned int MEM62AIU:0;                /**< \brief [61:62] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_62:1;             /**< \brief \internal Reserved */
    unsigned int MEM63AIU:0;                /**< \brief [62:63] Memory x MBIST AutoInitialize Underway (rwh) */
} Ifx_MTU_MEMSTAT1_Bits;

/** \\brief  Memory Autoinitialize Status Register 2 */
typedef struct _Ifx_MTU_MEMSTAT2_Bits
{
    unsigned int reserved_0:64;             /**< \brief \internal Reserved */
    unsigned int MEM64AIU:0;                /**< \brief [63:64] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_64:1;             /**< \brief \internal Reserved */
    unsigned int MEM65AIU:0;                /**< \brief [64:65] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_65:1;             /**< \brief \internal Reserved */
    unsigned int MEM66AIU:0;                /**< \brief [65:66] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_66:1;             /**< \brief \internal Reserved */
    unsigned int MEM67AIU:0;                /**< \brief [66:67] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_67:1;             /**< \brief \internal Reserved */
    unsigned int MEM68AIU:0;                /**< \brief [67:68] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_68:1;             /**< \brief \internal Reserved */
    unsigned int MEM69AIU:0;                /**< \brief [68:69] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_69:1;             /**< \brief \internal Reserved */
    unsigned int MEM70AIU:0;                /**< \brief [69:70] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_70:1;             /**< \brief \internal Reserved */
    unsigned int MEM71AIU:0;                /**< \brief [70:71] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_71:1;             /**< \brief \internal Reserved */
    unsigned int MEM72AIU:0;                /**< \brief [71:72] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_72:1;             /**< \brief \internal Reserved */
    unsigned int MEM73AIU:0;                /**< \brief [72:73] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_73:1;             /**< \brief \internal Reserved */
    unsigned int MEM74AIU:0;                /**< \brief [73:74] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_74:1;             /**< \brief \internal Reserved */
    unsigned int MEM75AIU:0;                /**< \brief [74:75] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_75:1;             /**< \brief \internal Reserved */
    unsigned int MEM76AIU:0;                /**< \brief [75:76] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_76:1;             /**< \brief \internal Reserved */
    unsigned int MEM77AIU:0;                /**< \brief [76:77] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_77:1;             /**< \brief \internal Reserved */
    unsigned int MEM78AIU:0;                /**< \brief [77:78] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_78:1;             /**< \brief \internal Reserved */
    unsigned int MEM79AIU:0;                /**< \brief [78:79] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_79:1;             /**< \brief \internal Reserved */
    unsigned int MEM80AIU:0;                /**< \brief [79:80] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_80:1;             /**< \brief \internal Reserved */
    unsigned int MEM81AIU:0;                /**< \brief [80:81] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_81:1;             /**< \brief \internal Reserved */
    unsigned int MEM82AIU:0;                /**< \brief [81:82] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_82:1;             /**< \brief \internal Reserved */
    unsigned int MEM83AIU:0;                /**< \brief [82:83] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_83:1;             /**< \brief \internal Reserved */
    unsigned int MEM84AIU:0;                /**< \brief [83:84] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_84:1;             /**< \brief \internal Reserved */
    unsigned int MEM85AIU:0;                /**< \brief [84:85] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_85:1;             /**< \brief \internal Reserved */
    unsigned int MEM86AIU:0;                /**< \brief [85:86] Memory x MBIST AutoInitialize Underway (rwh) */
    unsigned int reserved_86:1;             /**< \brief \internal Reserved */
    unsigned int MEM87AIU:0;                /**< \brief [86:87] Memory x MBIST AutoInitialize Underway (rwh) */
} Ifx_MTU_MEMSTAT2_Bits;

/** \\brief  Memory MBIST Enable Register 0 */
typedef struct _Ifx_MTU_MEMTEST0_Bits
{
    unsigned int CPU2DSEN:1;                /**< \brief [0:0] CPU2 DSPR MBIST Controller Memory Enable (rw) */
    unsigned int CPU2DCEN:1;                /**< \brief [1:1] CPU2 DCACHE MBIST Controller Memory Enable (rw) */
    unsigned int CPU2DTEN:1;                /**< \brief [2:2] CPU2 DTAG MBIST Controller Memory Enable (rw) */
    unsigned int CPU2PSEN:1;                /**< \brief [3:3] CPU2 PSPR MBIST Controller Memory Enable (rw) */
    unsigned int CPU2PCEN:1;                /**< \brief [4:4] CPU2 PCACHE MBIST Controller Memory Enable (rw) */
    unsigned int CPU2PTEN:1;                /**< \brief [5:5] CPU2 PTAG MBIST Controller Memory Enable (rw) */
    unsigned int CPU1DSEN:1;                /**< \brief [6:6] CPU1 DSPR MBIST Controller Memory Enable (rw) */
    unsigned int CPU1DCEN:1;                /**< \brief [7:7] CPU1 DCACHE MBIST Controller Memory Enable (rw) */
    unsigned int CPU1DTEN:1;                /**< \brief [8:8] CPU1 DTAG MBIST Controller Memory Enable (rw) */
    unsigned int CPU1PSEN:1;                /**< \brief [9:9] CPU1 PSPR MBIST Controller Memory Enable (rw) */
    unsigned int CPU1PCEN:1;                /**< \brief [10:10] CPU1 PCACHE MBIST Controller Memory Enable (rw) */
    unsigned int CPU1PTEN:1;                /**< \brief [11:11] CPU1 PTAG MBIST Controller Memory Enable (rw) */
    unsigned int reserved_12:2;             /**< \brief \internal Reserved */
    unsigned int CPU0DSEN:1;                /**< \brief [14:14] CPU0 DSPR MBIST Controller Memory Enable (rw) */
    unsigned int CPU0PCEN:1;                /**< \brief [15:15] CPU0 PCACHE MBIST Controller Memory Enable (rw) */
    unsigned int CPU0PSEN:1;                /**< \brief [16:16] CPU0 PSPR MBIST Controller Memory Enable (rw) */
    unsigned int CPU0PTEN:1;                /**< \brief [17:17] CPU0 PTAG MBIST Controller Memory Enable (rw) */
    unsigned int reserved_18:4;             /**< \brief \internal Reserved */
    unsigned int ETHEN:1;                   /**< \brief [22:22] ETHERMAC MBIST Controller Memory Enable (rw) */
    unsigned int HSMCEN:1;                  /**< \brief [23:23] HSM CACHE MBIST Controller Memory Enable (rw) */
    unsigned int HSMTEN:1;                  /**< \brief [24:24] HSM TAG MBIST Controller Memory Enable (rw) */
    unsigned int HSMREN:1;                  /**< \brief [25:25] HSM RAM MBIST Controller Memory Enable (rw) */
    unsigned int FSI0EN:1;                  /**< \brief [26:26] FSI0 MBIST Controller Memory Enable (rw) */
    unsigned int reserved_27:1;             /**< \brief \internal Reserved */
    unsigned int GTMFEN:1;                  /**< \brief [28:28] GTM FIFO0 MBIST Controller Memory Enable (rw) */
    unsigned int GTMM0EN:1;                 /**< \brief [29:29] GTM MCS0 MBIST Controller Memory Enable (rw) */
    unsigned int GTMM1EN:1;                 /**< \brief [30:30] GTM RAM1 MBIST Controller Memory Enable (rw) */
    unsigned int GTM1AEN:1;                 /**< \brief [31:31] GTM RAM1A MBIST Controller Memory Enable (rw) */
} Ifx_MTU_MEMTEST0_Bits;

/** \\brief  Memory MBIST Enable Register 1 */
typedef struct _Ifx_MTU_MEMTEST1_Bits
{
    unsigned int GTM1BEN:1;                 /**< \brief [0:0] GTM RAM1B Controller Memory Enable (rw) */
    unsigned int GTM2EN:1;                  /**< \brief [1:1] GTM RAM2 Controller Memory Enable (rw) */
    unsigned int PSI5EN:1;                  /**< \brief [2:2] PSI5 Controller Memory Enable (rw) */
    unsigned int BMUEN:1;                   /**< \brief [3:3] BMU Controller Memory Enable (rw) */
    unsigned int MCAN0EN:1;                 /**< \brief [4:4] GTM RAM1B Controller Memory Enable (rw) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int ERAY0OEN:1;                /**< \brief [6:6] ERAY0 OBF Controller Memory Enable (rw) */
    unsigned int ERAY0TEN:1;                /**< \brief [7:7] ERAY0 TBF Controller Memory Enable (rw) */
    unsigned int ERAY0MEN:1;                /**< \brief [8:8] ERAY0 MBF Controller Memory Enable (rw) */
    unsigned int reserved_9:4;              /**< \brief \internal Reserved */
    unsigned int MCDSEN:1;                  /**< \brief [13:13] MCDS Controller Memory Enable (ED only) (rw) */
    unsigned int EMEML0EN:1;                /**< \brief [14:14] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML1EN:1;                /**< \brief [15:15] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML2EN:1;                /**< \brief [16:16] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML3EN:1;                /**< \brief [17:17] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML4EN:1;                /**< \brief [18:18] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML5EN:1;                /**< \brief [19:19] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML6EN:1;                /**< \brief [20:20] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML7EN:1;                /**< \brief [21:21] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML8EN:1;                /**< \brief [22:22] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML9EN:1;                /**< \brief [23:23] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML10EN:1;               /**< \brief [24:24] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML11EN:1;               /**< \brief [25:25] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML12EN:1;               /**< \brief [26:26] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML13EN:1;               /**< \brief [27:27] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML14EN:1;               /**< \brief [28:28] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int EMEML15EN:1;               /**< \brief [29:29] EMEM Lower x MBIST Controller Memory Test Enable (ED only) (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_MTU_MEMTEST1_Bits;

/** \\brief  Memory MBIST Enable Register 2 */
typedef struct _Ifx_MTU_MEMTEST2_Bits
{
    unsigned int reserved_0:14;             /**< \brief \internal Reserved */
    unsigned int CIF0EN:1;                  /**< \brief [14:14] CIF JPEG1_4 Memory Enable (ED only) (rw) */
    unsigned int DAMEN:1;                   /**< \brief [15:15] DAM Memory Enable (rw) */
    unsigned int CIF1EN:1;                  /**< \brief [16:16] CIF JPEG3 Memory Enable (ED only) (rw) */
    unsigned int CIF2EN:1;                  /**< \brief [17:17] CIF Memory2 Enable (ED only) (rw) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_MTU_MEMTEST2_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mtu_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_ACCEN0_Bits B;
} Ifx_MTU_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_ACCEN1_Bits B;
} Ifx_MTU_ACCEN1;

/** \\brief  Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_ID_Bits B;
} Ifx_MTU_ID;

/** \\brief  Memory Autoinitialize Status Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MTU_MEMSTAT0_Bits B;
} Ifx_MTU_MEMSTAT0;

